IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/BoschAppBoard/src/bmi3_defs.h
/**
* Copyright (c) 2023 Bosch Sensortec GmbH. All rights reserved.
*
* BSD-3-Clause
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* 3. Neither the name of the copyright holder nor the names of its
*    contributors may be used to endorse or promote products derived from
*    this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
* FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
* COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
* @file       bmi3_defs.h
* @date       2023-02-17
* @version    v2.1.0
*
*/
 #ifndef _BMI3_DEFS_H
 #define _BMI3_DEFS_H

/********************************************************* */
/*!             Header includes                           */
/********************************************************* */
#ifdef __KERNEL__
#include <linux/types.h>
#include <linux/kernel.h>
#else
#include <stdint.h>
#include <stddef.h>
#endif

/********************************************************* */
/*!               Common Macros                           */
/********************************************************* */
#ifdef __KERNEL__
#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)    S8_C(x)
#define UINT8_C(x)   U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)   S16_C(x)
#define UINT16_C(x)  U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)   S32_C(x)
#define UINT32_C(x)  U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)   S64_C(x)
#define UINT64_C(x)  U64_C(x)
#endif
#endif

/*! C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL         0
#else
#define NULL         ((void *) 0)
#endif
#endif

/********************************************************* */
/*!             General Macro Definitions                 */
/********************************************************* */
/*! Utility macros */
#define BMI3_SET_BITS(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MASK)) | \
     ((data << bitname##_POS) & bitname##_MASK))

#define BMI3_GET_BITS(reg_data, bitname) \
    ((reg_data & (bitname##_MASK)) >> \
     (bitname##_POS))

#define BMI3_SET_BIT_POS0(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MASK)) | \
     (data & bitname##_MASK))

#define BMI3_GET_BIT_POS0(reg_data, bitname)         (reg_data & (bitname##_MASK))
#define BMI3_SET_BIT_VAL0(reg_data, bitname)         (reg_data & ~(bitname##_MASK))

/*! LSB and MSB mask definitions */
#define BMI3_SET_LOW_BYTE                            UINT16_C(0x00FF)
#define BMI3_SET_HIGH_BYTE                           UINT16_C(0xFF00)
#define BMI3_SET_LOW_NIBBLE                          UINT8_C(0x0F)

/*! For getting LSB and MSB */
#define BMI3_GET_LSB(var)                            (uint8_t)(var & BMI3_SET_LOW_BYTE)
#define BMI3_GET_MSB(var)                            (uint8_t)((var & BMI3_SET_HIGH_BYTE) >> 8)

/*! For enable and disable */
#define BMI3_ENABLE                                  UINT8_C(1)
#define BMI3_DISABLE                                 UINT8_C(0)

/*! To define TRUE or FALSE */
#define BMI3_TRUE                                    UINT8_C(1)
#define BMI3_FALSE                                   UINT8_C(0)

/*!
 * BMI3_INTF_RET_TYPE is the read/write interface return type which can be overwritten by the build system.
 * The default is set to int8_t.
 */
#ifndef BMI3_INTF_RET_TYPE
#define BMI3_INTF_RET_TYPE                           int8_t
#endif

/*!
 * BMI3_INTF_RET_SUCCESS is the success return value read/write interface return type which can be
 * overwritten by the build system. The default is set to 0.
 */
#ifndef BMI3_INTF_RET_SUCCESS
#define BMI3_INTF_RET_SUCCESS                        INT8_C(0)
#endif

/*! To define success code */
#define BMI3_OK                                      INT8_C(0)

/*! To define error codes */
#define BMI3_E_NULL_PTR                              INT8_C(-1)
#define BMI3_E_COM_FAIL                              INT8_C(-2)
#define BMI3_E_DEV_NOT_FOUND                         INT8_C(-3)
#define BMI3_E_ACC_INVALID_CFG                       INT8_C(-4)
#define BMI3_E_GYRO_INVALID_CFG                      INT8_C(-5)
#define BMI3_E_INVALID_SENSOR                        INT8_C(-6)
#define BMI3_E_INVALID_INT_PIN                       INT8_C(-7)
#define BMI3_E_INVALID_INPUT                         INT8_C(-8)
#define BMI3_E_INVALID_STATUS                        INT8_C(-9)
#define BMI3_E_DATA_RDY_INT_FAILED                   INT8_C(-10)
#define BMI3_E_INVALID_FOC_POSITION                  INT8_C(-11)
#define BMI3_E_INVALID_ST_SELECTION                  INT8_C(-12)
#define BMI3_E_OUT_OF_RANGE                          INT8_C(-13)
#define BMI3_E_FEATURE_ENGINE_STATUS                 INT8_C(-14)

/*! BMI3 Commands */
#define BMI3_CMD_SELF_TEST_TRIGGER                   UINT16_C(0x0100)
#define BMI3_CMD_SELF_CALIB_TRIGGER                  UINT16_C(0x0101)
#define BMI3_CMD_SELF_CALIB_ABORT                    UINT16_C(0x0200)
#define BMI3_CMD_I3C_TCSYNC_UPDATE                   UINT16_C(0x0201)
#define BMI3_CMD_AXIS_MAP_UPDATE                     UINT16_C(0x0300)
#define BMI3_CMD_1                                   UINT16_C(0x64AD)
#define BMI3_CMD_2                                   UINT16_C(0xD3AC)
#define BMI3_CMD_SOFT_RESET                          UINT16_C(0xDEAF)

