IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/BoschAppBoard/src/bmi3_defs.h
#define BMI3_ACC_FOC_2G_OFFSET        UINT16_C(819)
#define BMI3_ACC_FOC_4G_OFFSET        UINT16_C(410)
#define BMI3_ACC_FOC_8G_OFFSET        UINT16_C(205)
#define BMI3_ACC_FOC_16G_OFFSET       UINT16_C(102)

#define BMI3_FOC_SAMPLE_LIMIT         UINT8_C(128)

#define BMI3_ACC_2G_MAX_NOISE_LIMIT   (BMI3_ACC_FOC_2G_REF + BMI3_ACC_FOC_2G_OFFSET)
#define BMI3_ACC_2G_MIN_NOISE_LIMIT   (BMI3_ACC_FOC_2G_REF - BMI3_ACC_FOC_2G_OFFSET)
#define BMI3_ACC_4G_MAX_NOISE_LIMIT   (BMI3_ACC_FOC_4G_REF + BMI3_ACC_FOC_4G_OFFSET)
#define BMI3_ACC_4G_MIN_NOISE_LIMIT   (BMI3_ACC_FOC_4G_REF - BMI3_ACC_FOC_4G_OFFSET)
#define BMI3_ACC_8G_MAX_NOISE_LIMIT   (BMI3_ACC_FOC_8G_REF + BMI3_ACC_FOC_8G_OFFSET)
#define BMI3_ACC_8G_MIN_NOISE_LIMIT   (BMI3_ACC_FOC_8G_REF - BMI3_ACC_FOC_8G_OFFSET)
#define BMI3_ACC_16G_MAX_NOISE_LIMIT  (BMI3_ACC_FOC_16G_REF + BMI3_ACC_FOC_16G_OFFSET)
#define BMI3_ACC_16G_MIN_NOISE_LIMIT  (BMI3_ACC_FOC_16G_REF - BMI3_ACC_FOC_16G_OFFSET)

/*! Macro to define accelerometer configuration value for FOC */
#define BMI3_FOC_ACC_CONF_VAL_LSB     UINT8_C(0xB7)
#define BMI3_FOC_ACC_CONF_VAL_MSB     UINT8_C(0x40)

/*! Macro to define X Y and Z axis for an array */
#define BMI3_X_AXIS                   UINT8_C(0)
#define BMI3_Y_AXIS                   UINT8_C(1)
#define BMI3_Z_AXIS                   UINT8_C(2)

#define BMI3_FOC_INVERT_VALUE         INT8_C(-1)

/*! For defining absolute values */
#define BMI3_ABS(a)                   ((a) > 0 ? (a) : -(a))

/*! Sensortime resolution in seconds */
#define BMI3_SENSORTIME_RESOLUTION    0.0000390625f

/*! Maximum number of interrupt pins */
#define BMI3_INT_PIN_MAX_NUM          UINT8_C(2)

/*! Maximum available register length */
#define BMI3_MAX_LEN                  UINT8_C(128)

#define BMI3_ACC_2G                   UINT8_C(2)
#define BMI3_ACC_4G                   UINT8_C(4)
#define BMI3_ACC_8G                   UINT8_C(8)
#define BMI3_ACC_16G                  UINT8_C(16)

#define BMI3_ACC_2G_BIT_POS           UINT8_C(1)
#define BMI3_ACC_4G_BIT_POS           UINT8_C(2)
#define BMI3_ACC_8G_BIT_POS           UINT8_C(3)
#define BMI3_ACC_16G_BIT_POS          UINT8_C(4)

/******************************************************************************/
/*! @name       Gyro self-calibration/self-test coefficient macros  */
/******************************************************************************/
#define BMI3_SC_ST_VALUE_0            UINT16_C(0x5A2E)
#define BMI3_SC_ST_VALUE_1            UINT16_C(0x9219)
#define BMI3_SC_ST_VALUE_2            UINT16_C(0x5637)
#define BMI3_SC_ST_VALUE_3            UINT16_C(0xFFE8)
#define BMI3_SC_ST_VALUE_4            UINT16_C(0xFFEF)
#define BMI3_SC_ST_VALUE_5            UINT16_C(0x000D)
#define BMI3_SC_ST_VALUE_6            UINT16_C(0x07CA)
#define BMI3_SC_ST_VALUE_7            UINT16_C(0xFFCD)
#define BMI3_SC_ST_VALUE_8            UINT16_C(0xEF6C)

#define BMI3_SC_SENSITIVITY_EN        UINT8_C(1)
#define BMI3_SC_OFFSET_EN             UINT8_C(2)

/*! Self-calibration enable disable macros */
#define BMI3_SC_APPLY_CORR_DIS        UINT8_C(0)
#define BMI3_SC_APPLY_CORR_EN         UINT8_C(4)

/********************************************************* */
/*!               Function Pointers                       */
/********************************************************* */

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific read functions of the user
 *
 * @param[in]     reg_addr : 8bit register address of the sensor
 * @param[out]    reg_data : Data from the specified address
 * @param[in]     length   : Length of the reg_data array
 * @param[in,out] intf_ptr : Void pointer that can enable the linking of descriptors
 *                           for interface related callbacks
 * @retval 0 for Success
 * @retval Non-zero for Failure
 */
typedef BMI3_INTF_RET_TYPE (*bmi3_read_fptr_t)(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr);

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific write functions of the user
 *
 * @param[in]     reg_addr : 8bit register address of the sensor
 * @param[in]     reg_data : Data to the specified address
 * @param[in]     length   : Length of the reg_data array
 * @param[in,out] intf_ptr : Void pointer that can enable the linking of descriptors
 *                           for interface related callbacks
 * @retval 0 for Success
 * @retval Non-zero for Failure
 *
 */
typedef BMI3_INTF_RET_TYPE (*bmi3_write_fptr_t)(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length,
                                                void *intf_ptr);

/*!
 * @brief Delay function pointer which should be mapped to
 * delay function of the user
 *
 * @param[in] period       : The time period in microseconds
 * @param[in,out] intf_ptr : Void pointer that can enable the linking of descriptors
 *                           for interface related callbacks
 */
typedef void (*bmi3_delay_us_fptr_t)(uint32_t period, void *intf_ptr);

/********************************************************* */
/*!                  Enumerators                          */
/********************************************************* */

/*!
 * @name Enumerator describing interfaces
 */
enum bmi3_intf {
    /*! SPI interface */
    BMI3_SPI_INTF = 0,
    /*! I2C interface */
    BMI3_I2C_INTF,
    /*! I3C interface */
    BMI3_I3C_INTF
};

/*!
 * @name Enum to define interrupt lines
 */
enum bmi3_hw_int_pin {
    BMI3_INT_NONE,
    BMI3_INT1,
    BMI3_INT2,
    BMI3_I3C_INT,
    BMI3_INT_PIN_MAX
};

/********************************************************* */
/*!                      Structures                       */
/********************************************************* */

/*!
 * @brief Structure to store the local copy of the re-mapped axis and
 * the value of its sign for register settings
 */
struct bmi3_axes_remap
{
    /*! Re-map x, y and z axis */
    uint8_t axis_map;

    /*! Re-mapped x-axis sign */
    uint8_t invert_x;

    /*! Re-mapped y-axis sign */
    uint8_t invert_y;

    /*! Re-mapped z-axis sign */
    uint8_t invert_z;
};

/*!
 * @brief Structure to define FIFO frame configuration
 */
struct bmi3_fifo_frame
{
    /*! Pointer to FIFO data */
    uint8_t *data;

