IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/BoschAppBoard/src/bmi3_defs.h
    /*! Number of user defined bytes of FIFO to be read */
    uint16_t length;

    /*! Enables type of data to be streamed - accelerometer,
     *  gyroscope and temperature
     */
    uint16_t available_fifo_sens;

    /*! Water-mark level for water-mark interrupt */
    uint16_t wm_lvl;

    /*! Available fifo length in words */
    uint16_t available_fifo_len;

    /*! To store available fifo accel frames */
    uint16_t avail_fifo_accel_frames;

    /*! Available fifo sensor time frames */
    uint8_t avail_fifo_sens_time_frames;

    /*! To store available fifo gyro frames */
    uint16_t avail_fifo_gyro_frames;

    /*! To store available fifo temperature frames */
    uint16_t avail_fifo_temp_frames;
};

/*!
 * @brief Primary device structure
 */
struct bmi3_dev
{
    /*! Chip id of BMI3 */
    uint8_t chip_id;

    /*!
     * The interface pointer is used to enable the user
     * to link their interface descriptors for reference during the
     * implementation of the read and write interfaces to the
     * hardware.
     */
    void *intf_ptr;

    /*!
     * To store information during boundary check conditions
     * If minimum value is stored, update info with BMI3_I_MIN_VALUE
     * If maximum value is stored, update info with BMI3_I_MAX_VALUE
     */
    uint8_t info;

    /*! Type of Interface  */
    enum bmi3_intf intf;

    /*! To store interface pointer error */
    BMI3_INTF_RET_TYPE intf_rslt;

    /*! For switching from I2C to SPI */
    uint8_t dummy_byte;

    /*! Resolution for FOC */
    uint8_t resolution;

    /*! User set read/write length */
    uint16_t read_write_len;

    /*! Read function pointer */
    bmi3_read_fptr_t read;

    /*! Write function pointer */
    bmi3_write_fptr_t write;

    /*! Delay function pointer */
    bmi3_delay_us_fptr_t delay_us;

    /*! Accel bit width */
    uint16_t accel_bit_width;
};

/*!
 * @brief Structure to define Interrupt pin configuration
 */
struct bmi3_int_pin_cfg
{
    /*! Configure level of interrupt pin */
    uint8_t lvl;

    /*! Configure behavior of interrupt pin */
    uint8_t od;

    /*! Output enable for interrupt pin */
    uint8_t output_en;
};

/*!
 * @brief Structure to define interrupt pin type, mode and configurations
 */
struct bmi3_int_pin_config
{
    /*! Interrupt pin type: INT1 or INT2 or BOTH */
    uint8_t pin_type;

    /*! Latched or non-latched mode */
    uint8_t int_latch;

    /*! Structure to define Interrupt pin configuration */
    struct bmi3_int_pin_cfg pin_cfg[BMI3_INT_PIN_MAX_NUM];
};

/*!
 * @brief Structure to define accelerometer and gyroscope sensor axes and
 * sensor time for virtual frames
 */
struct bmi3_sens_axes_data
{
    /*! Data in x-axis */
    int16_t x;

    /*! Data in y-axis */
    int16_t y;

    /*! Data in z-axis */
    int16_t z;

    /*! Sensor time for frames */
    uint32_t sens_time;

    /*! Saturation flag status for X axis */
    uint8_t sat_x : 1;

    /*! Saturation flag status for Y axis */
    uint8_t sat_y : 1;

    /*! Saturation flag status for Z axis */
    uint8_t sat_z : 1;
};

/*!
 * @brief Structure to define accelerometer and gyroscope sensor axes and
 * sensor time for virtual frames
 */
struct bmi3_i3c_sync_data
{
    /*! Data in x-axis */
    uint16_t sync_x;

    /*! Data in y-axis */
    uint16_t sync_y;

    /*! Data in z-axis */
    uint16_t sync_z;

    /*! Temperature data */
    uint16_t sync_temp;

    /*! Sensor time for frames */
    uint16_t sync_time;
};

/*!
 * @brief Structure to define FIFO accel, gyro x, y and z axis and
 * sensor time
 */
struct bmi3_fifo_sens_axes_data
{
    /*! Data in x-axis */
    int16_t x;

    /*! Data in y-axis */
    int16_t y;

    /*! Data in z-axis */
    int16_t z;

    /*! Sensor time data */
    uint16_t sensor_time;
};

/*!
 * @brief Structure to define FIFO temperature and sensor time
 */
struct bmi3_fifo_temperature_data
{
    /*! Temperature data */
    uint16_t temp_data;

    /*! Sensor time data */
    uint16_t sensor_time;
};

/*!
 * @brief Structure to define orientation output
 */
struct bmi3_orientation_output
{
    /*! Orientation portrait landscape */
    uint8_t orientation_portrait_landscape;

    /*! Orientation face-up down  */
    uint8_t orientation_faceup_down;
};

/*!
 * @brief Structure to define gyroscope saturation status of user gain
 */
struct bmi3_gyr_user_gain_status
{
    /*! Status in x-axis */
    uint8_t sat_x;

    /*! Status in y-axis */
    uint8_t sat_y;

    /*! Status in z-axis */
    uint8_t sat_z;

    /*! G trigger status */
    uint8_t g_trigger_status;
};

/*!
 * @brief Structure to define accelerometer and gyroscope self test feature status
 */
struct bmi3_st_result
{
    /*! Self test completed */
    uint8_t self_test_rslt;

    /*! Bit is set to 1 when accelerometer X-axis test passed */
    uint8_t acc_sens_x_ok;

    /*! Bit is set to 1 when accelerometer y-axis test passed */
    uint8_t acc_sens_y_ok;

    /*! Bit is set to 1 when accelerometer z-axis test passed */
    uint8_t acc_sens_z_ok;

    /*! Bit is set to 1 when gyroscope X-axis test passed */
    uint8_t gyr_sens_x_ok;

    /*! Bit is set to 1 when gyroscope y-axis test passed */
    uint8_t gyr_sens_y_ok;

    /*! Bit is set to 1 when gyroscope z-axis test passed */
    uint8_t gyr_sens_z_ok;

    /*! Bit is set to 1 when gyroscope drive test passed */
    uint8_t gyr_drive_ok;

    /*! Stores the self-test error code result */
    uint8_t self_test_err_rslt;
};

/*!
 * @brief Union to define BMI3 sensor data
 */
union bmi3_sens_data
{
    /*! Accelerometer axes data */
    struct bmi3_sens_axes_data acc;

    /*! Gyroscope axes data */
    struct bmi3_sens_axes_data gyr;

    /*! Step counter output */
    uint32_t step_counter_output;

    /*! Orientation output */
    struct bmi3_orientation_output orient_output;

    /*! Gyroscope user gain saturation status */
    struct bmi3_gyr_user_gain_status gyro_user_gain_status;

    /*! I3C sync data */
    struct bmi3_i3c_sync_data i3c_sync;
};

/*!
 * @brief Structure to define type of sensor and their respective data
 */
struct bmi3_sensor_data
{
    /*! Defines the type of sensor */
    uint8_t type;

