IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/BoschAppBoard/src/bmi3_defs.h
    /*! Minimum duration between two tap impact */
    uint8_t min_quite_dur_between_taps;

    /*! Minimum quite time between the two gesture detection */
    uint8_t quite_time_after_gest;
};

/*!
 * @brief Structure to define alternate accel configuration
 */
struct bmi3_alt_accel_config
{
    /*! ODR in Hz */
    uint8_t alt_acc_odr;

    /*! Filter accel mode */
    uint8_t alt_acc_mode;

    /*! Defines the number of samples to be averaged */
    uint8_t alt_acc_avg_num;
};

/*!
 * @brief Structure to define alternate gyro configuration
 */
struct bmi3_alt_gyro_config
{
    /*! ODR in Hz */
    uint8_t alt_gyro_odr;

    /*! Filter gyro mode */
    uint8_t alt_gyro_mode;

    /*! Defines the number of samples to be averaged */
    uint8_t alt_gyro_avg_num;
};

/*!
 * @brief Structure to define alternate auto configuration
 */
struct bmi3_auto_config_change
{
    /*! Mode to set features on alternate configurations */
    uint8_t alt_conf_alt_switch_src_select;

    /*! Mode to switch from alternate configurations to user configurations */
    uint8_t alt_conf_user_switch_src_select;
};

/*!
 * @brief Union to define the sensor configurations
 */
union bmi3_sens_config_types
{
    /*! Accelerometer configuration */
    struct bmi3_accel_config acc;

    /*! Gyroscope configuration */
    struct bmi3_gyro_config gyr;

    /*! Any-motion configuration */
    struct bmi3_any_motion_config any_motion;

    /*! No-motion configuration */
    struct bmi3_no_motion_config no_motion;

    /*! Sig_motion configuration */
    struct bmi3_sig_motion_config sig_motion;

    /*! Step counter configuration */
    struct bmi3_step_counter_config step_counter;

    /*! Gyroscope user gain configuration */
    struct bmi3_gyro_user_gain_config gyro_gain_update;

    /*! Tilt configuration */
    struct bmi3_tilt_config tilt;

    /*! Orientation configuration */
    struct bmi3_orientation_config orientation;

    /*! Flat configuration */
    struct bmi3_flat_config flat;

    /*! Tap configuration */
    struct bmi3_tap_detector_config tap;

    /*! Alternate accelerometer configuration */
    struct bmi3_alt_accel_config alt_acc;

    /*! Alternate gyroscope configuration */
    struct bmi3_alt_gyro_config alt_gyr;

    /*! Alternate auto configuration */
    struct bmi3_auto_config_change alt_auto_cfg;
};

/*!
 * @brief Structure to define the type of the sensor and its configurations
 */
struct bmi3_sens_config
{
    /*! Defines the type of sensor */
    uint8_t type;

    /*! Defines various sensor configurations */
    union bmi3_sens_config_types cfg;
};

/*!
 * @brief Error Status structure
 */
struct bmi3_err_reg
{
    /*! Indicates fatal error */
    uint8_t fatal_err;

    /*! Overload of the feature engine detected. */
    uint8_t feat_eng_ovrld;

    /*! Watchdog timer of the feature engine triggered. */
    uint8_t feat_eng_wd;

    /*! Indicates accel configuration error */
    uint8_t acc_conf_err;

    /*! Indicates gyro configuration error */
    uint8_t gyr_conf_err;

    /*! Indicates SDR parity error */
    uint8_t i3c_error0;

    /*! Indicates I3C error */
    uint8_t i3c_error3;
};

/*!
 * @brief Structure to store feature enable
 */
struct bmi3_feature_enable
{
    /*! Enables no-motion feature for X-axis */
    uint8_t no_motion_x_en;

    /*! Enables no-motion feature for Y-axis */
    uint8_t no_motion_y_en;

    /*! Enables no-motion feature for Z-axis */
    uint8_t no_motion_z_en;

    /*! Enables any-motion feature for X-axis */
    uint8_t any_motion_x_en;

    /*! Enables any-motion feature for Y-axis */
    uint8_t any_motion_y_en;

    /*! Enables any-motion feature for Z-axis */
    uint8_t any_motion_z_en;

    /*! Enables flat feature */
    uint8_t flat_en;

    /*! Enables orientation feature */
    uint8_t orientation_en;

    /*! Enables step detector feature */
    uint8_t step_detector_en;

    /*! Enables step counter feature */
    uint8_t step_counter_en;

    /*! Enables significant motion feature */
    uint8_t sig_motion_en;

    /*! Enables tilt feature */
    uint8_t tilt_en;

    /*! Enables single tap feature */
    uint8_t tap_detector_s_tap_en;

    /*! Enables double tap feature */
    uint8_t tap_detector_d_tap_en;

    /*! Enables triple tap feature */
    uint8_t tap_detector_t_tap_en;

    /*! Enables I3C TC-sync feature */
    uint8_t i3c_sync_en;
};

/*!
 * @brief Structure to map interrupt
 */
struct bmi3_map_int
{
    /*! Map interrupt output to either INT1 or INT2 or IBI
     *  Value   Name        Description
     *   00   DISABLED   Interrupt disabled
     *   01   MAP_INT1     Mapped to INT1
     *   10   MAP_INT2     Mapped to INT2
     *   11   MAP_IBI     Mapped to I3C IBI
     */

    /*! Maps no-motion output to either INT1 or INT2 or IBI */
    uint8_t no_motion_out;

    /*! Maps any-motion output to either INT1 or INT2 or IBI */
    uint8_t any_motion_out;

    /*! Maps flat output to either INT1 or INT2 or IBI */
    uint8_t flat_out;

    /*! Maps orientation output to either INT1 or INT2 or IBI */
    uint8_t orientation_out;

    /*! Maps step detector output to either INT1 or INT2 or IBI */
    uint8_t step_detector_out;

    /*! Maps step counter output to either INT1 or INT2 or IBI */
    uint8_t step_counter_out;

    /*! Maps significant motion output to either INT1 or INT2 or IBI */
    uint8_t sig_motion_out;

    /*! Maps tilt output to either INT1 or INT2 or IBI */
    uint8_t tilt_out;

    /*! Maps tap output to either INT1 or INT2 or IBI */
    uint8_t tap_out;

    /*! Maps i3c output to either INT1 or INT2 or IBI  */
    uint8_t i3c_out;

    /*! Maps feature engine's error or status change to either INT1 or INT2 or IBI */
    uint8_t err_status;

    /*! Maps temperature data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t temp_drdy_int;

    /*! Maps gyro data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t gyr_drdy_int;

    /*! Maps accel data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t acc_drdy_int;

    /*! Maps FIFO watermark interrupt to either INT1 or INT2 or IBI */
    uint8_t fifo_watermark_int;

    /*! Maps FIFO full interrupt to either INT1 or INT2 or IBI */
    uint8_t fifo_full_int;
};

/*!
 * @brief Structure to store config version
 */
struct bmi3_config_version
{
    /*! Maps config1 major version */
    uint16_t config1_major_version;

    /*! Maps config1 minor version */
    uint8_t config1_minor_version;

    /*! Maps config2 major version */
    uint16_t config2_major_version;

    /*! Maps config2 minor version */
    uint8_t config2_minor_version;
};

/*!
 * @brief Structure to store self calibration result
 */
struct bmi3_self_calib_rslt
{
    /*! Stores the self-calibration result */
    uint8_t gyro_sc_rslt;

    /*! Stores the self-calibration error codes result */
    uint8_t sc_error_rslt;
};

/*!
 * @brief Structure to store alternate status
 */
struct bmi3_alt_status
{
    /*! Stores alternate accel status */
    uint8_t alt_accel_status;

    /*! Stores alternate gyro status */
    uint8_t alt_gyro_status;
};

/*!
 * @brief Structure to store accel dp gain offset values
 */
struct bmi3_acc_dp_gain_offset
{
    /*! Accel dp offset x-axis */
    uint16_t acc_dp_off_x;

    /*! Accel dp offset y-axis */
    uint16_t acc_dp_off_y;

    /*! Accel dp offset z-axis */
    uint16_t acc_dp_off_z;

    /*! Accel dp gain x-axis */
    uint8_t acc_dp_dgain_x;

